In [3]:
import sqlite3
import pandas as pd
import numpy as np

In [4]:
con = sqlite3.connect(':memory:')

In [5]:
data = pd.read_csv('D:\\DS\\DS school\\sql\\boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [6]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [7]:
pd.read_sql(
    '''
    SELECT * FROM boston
    limit 5
    ''',
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [8]:
tasks = 0

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [9]:
tasks+=1
pd.read_sql(
    '''
    select (SELECT count() as CRIM FROM boston where CRIM isnull) as CRIM, 
        (SELECT count() as ZN FROM boston where ZN isnull) as ZN,
        (SELECT count() as INDUS FROM boston where INDUS isnull) as INDUS,
        (SELECT count() as CHAS FROM boston where CHAS isnull) as CHAS,
        (SELECT count() as NOX FROM boston where NOX isnull) as NOX
    ''',
    con,
)

   CRIM  ZN  INDUS  CHAS  NOX
0     0   0      0     0    0

–í—ã–≤–æ–¥: –≤ –≤—ã–±—Ä–∞–Ω–Ω—ã—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –Ω–µ –æ–±–Ω–∞—Ä—É–∂–µ–Ω–æ

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [10]:
tasks+=1
pd.read_sql(
    '''
    select count(distinct CRIM) as CRIM, 
    count(distinct ZN) as ZN, 
    count(distinct INDUS) as INDUS, 
    count(distinct CHAS) as CHAS, 
    count(distinct NOX) as NOX from boston
    ''',
    con,
)

   CRIM  ZN  INDUS  CHAS  NOX
0   504  26     76     2   81

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.

–ù–µ –∑–Ω–∞—é, —è–≤–ª—è–µ—Ç—Å—è –ª–∏ —ç—Ç–æ —á–∏—Ç–∏–Ω–≥–æ–º, –Ω–æ –ø—Ä–æ–≤–µ—Ä–∫—É –Ω–∞ —á–µ—Ç–Ω–æ—Å—Ç—å/–Ω–µ—á–µ—Ç–Ω–æ—Å—Ç—å —Ä–µ—à–∏–ª –Ω–µ –ø–∏—Å–∞—Ç—å, —Ç.–∫. –º—ã –≤–∏–¥–∏–º –∏ —Ç–∞–∫, —á—Ç–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–ø–∏—Å–µ–π —á–µ—Ç–Ω–æ–µ

In [11]:
tasks+=1
pd.read_sql(
    '''
    select Name from 
    (
    SELECT 'CM' as 'Name', 
    (
    (SELECT AVG(CRIM) from
    (SELECT CRIM FROM boston ORDER BY CRIM LIMIT 2 OFFSET
    (SELECT (COUNT(*) - 2) / 2 FROM boston))) - (SELECT min(CRIM) from boston)
    ) as def
    union
    SELECT 'ZN',
    (
    (SELECT AVG(ZN) from
    (SELECT ZN FROM boston ORDER BY ZN LIMIT 2 OFFSET
    (SELECT (COUNT(*) - 2) / 2 FROM boston))) - (SELECT min(ZN) from boston)
    ) as def
    union
    SELECT 'INDUS',
    (
    (SELECT AVG(INDUS) from
    (SELECT INDUS FROM boston ORDER BY INDUS LIMIT 2 OFFSET
    (SELECT (COUNT(*) - 2) / 2 FROM boston))) - (SELECT min(INDUS) from boston)
    ) as def
    union
    SELECT 'CHAS',
    (
    (SELECT AVG(CHAS) from
    (SELECT CHAS FROM boston ORDER BY CHAS LIMIT 2 OFFSET
    (SELECT (COUNT(*) - 2) / 2 FROM boston))) - (SELECT min(CHAS) from boston)
    ) as def
    union
    SELECT 'NOX',
    (
    (SELECT AVG(NOX) from
    (SELECT NOX FROM boston ORDER BY NOX LIMIT 2 OFFSET
    (SELECT (COUNT(*) - 2) / 2 FROM boston))) - (SELECT min(NOX) from boston)
    ) as def
    ) where def = 0
    ''',
    con,
)

   Name
0  CHAS
1    ZN

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏.
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞). –ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [12]:
tasks+=1
pd.read_sql(
    '''
    select house, RM_exp, RM_cheap, (RM_exp-RM_cheap) as diff from
    (
    select 25 as 'house', 
    (select avg(RM) from (select rm, medv from boston where MEDV = (select max(MEDV) from boston))) as RM_exp,
    (select avg(RM) from (select rm, MEDV from boston order by MEDV limit 25)) as RM_cheap
    union
    select 50, 
    (select avg(RM) from (select rm, medv from boston where MEDV = (select max(MEDV) from boston))) as RM_exp,
    (select avg(RM) from (select rm, MEDV from boston order by MEDV limit 50)) as RM_cheap
    union
    select 100, 
    (select avg(RM) from (select rm, medv from boston where MEDV = (select max(MEDV) from boston))) as RM_exp,
    (select avg(RM) from (select rm, MEDV from boston order by MEDV limit 100)) as RM_cheap
    union
    select 200, 
    (select avg(RM) from (select rm, medv from boston where MEDV = (select max(MEDV) from boston))) as RM_exp,
    (select avg(RM) from (select rm, MEDV from boston order by MEDV limit 200)) as RM_cheap
    union
    select 300, 
    (select avg(RM) from (select rm, medv from boston where MEDV = (select max(MEDV) from boston))) as RM_exp,
    (select avg(RM) from (select rm, MEDV from boston order by MEDV limit 300)) as RM_cheap
    )
    ''',
    con,
)

   house  RM_exp  RM_cheap      diff
0     25   7.484  5.747840  1.736160
1     50   7.484  5.753240  1.730760
2    100   7.484  5.887120  1.596880
3    200   7.484  5.911705  1.572295
4    300   7.484  5.972227  1.511773

–í—ã–≤–æ–¥: –º–æ–∂–Ω–æ –æ—Ç–º–µ—Ç–∏—Ç—å, —á—Ç–æ —á–µ–º –¥–µ—à–µ–≤–ª–µ –∂–∏–ª—å–µ, —Ç–µ–º –±–æ–ª—å—à–µ —Ä–∞–∑–Ω–∏—Ü–∞ –≤ –∫–æ–ª–∏—á–µ—Å—Ç–≤–µ –∫–æ–º–Ω–∞—Ç –ø–æ —Å—Ä–∞–≤–Ω–µ–Ω–∏—é —Å —Å–∞–º—ã–º –¥–æ—Ä–æ–≥–∏–º. –ü—Ä–∏ —ç—Ç–æ–º —Ä–∞–∑–Ω–∏—Ü–∞ –≤ –∫–æ–ª–∏—á–µ—Å—Ç–≤–µ –∫–æ–º–Ω–∞—Ç –∑–∞–º–µ—Ç–Ω–æ —É–º–µ–Ω—å—à–∞–µ—Ç—Å—è –ø—Ä–∏ –ø–µ—Ä–µ—Ö–æ–¥–µ –æ—Ç –¢–û–ü-50 –¥–æ –¢–û–ü-100 —Å–∞–º–æ–≥–æ –¥–µ—à–µ–≤–æ–≥–æ –∂–∏–ª—å—è.

5. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [13]:
tasks+=1
pd.read_sql(
    '''
    select * from (
    select LSTAT, MEDV, rank() OVER (ORDER BY MEDV DESC) as rank from boston)
    where MEDV = (select max(medv) from boston) 
    ''',
    con,
)

    LSTAT  MEDV  rank
0    1.73  50.0     1
1    1.92  50.0     1
2    3.32  50.0     1
3    3.70  50.0     1
4    4.45  50.0     1
5    2.97  50.0     1
6    2.88  50.0     1
7    4.63  50.0     1
8    5.12  50.0     1
9    7.44  50.0     1
10   3.16  50.0     1
11   3.26  50.0     1
12   3.73  50.0     1
13   2.96  50.0     1
14   9.53  50.0     1
15   8.88  50.0     1

–í—ã–≤–æ–¥: –∫–æ—Ä—Ä–µ–ª—è—Ü–∏–∏ –º–µ–∂–¥—É –ø—Ä–æ—Ü–µ–Ω—Ç–æ–º –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º –∏ —Å—Ç–æ–∏–º–æ—Å—Ç—å—é –∂–∏–ª—å—è –Ω–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [14]:
tasks+=1
pd.read_sql(
    '''
    SELECT CHAS, avg(MEDV) as 'mean_price' FROM boston where CHAS = 0
    union
    SELECT CHAS, avg(MEDV) FROM boston where CHAS = 1
    ''',
    con,
)

   CHAS  mean_price
0   0.0   22.093843
1   1.0   28.440000

–í—ã–≤–æ–¥: —Å—Ç–æ–∏–º–æ—Å—Ç—å –∂–∏–ª—å—è –≤ —Å–ª—É—á–∞–µ, –µ—Å–ª–∏ –æ–Ω–æ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, —Å—É—â–µ—Å—Ç–≤–µ–Ω–Ω–æ –ø–æ–≤—ã—à–∞–µ—Ç—Å—è

7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

–£–±—Ä–∞–ª –∏–∑ –≤—ã–≤–æ–¥–∞ —Å—Ç–æ–ª–±–µ—Ü CHAS, —Ç.–∫. –Ω–µ —Å–æ–≤—Å–µ–º –ø–æ–Ω—è–ª, –∑–∞—á–µ–º –æ–Ω —Ç—É—Ç - –º—ã —Å—Ä–∞–Ω–∏–≤–∞–µ–º –≤–ª–∏—è–Ω–∏–µ —ç—Ç–æ–≥–æ –ø–∞—Ä–∞–º–µ—Ç—Ä–∞ –Ω–∞ –¥—Ä—É–≥–∏–µ –∑–Ω–∞—á–µ–Ω–∏—è, –ø—Ä–æ–≤–µ—Ä—è—Ç—å –µ–≥–æ –≤–ª–∏—è–µ–Ω–∏–µ –Ω–∞ —Å–∞–º–æ–≥–æ —Å–µ–±—è –∫–∞–∫ –±—É–¥—Ç–æ –±—ã –Ω–µ –ª–æ–≥–∏—á–Ω–æ

In [15]:
tasks+=1
pd.read_sql(
    '''
    select * from
    (
    select 'CRIM' as Column, 
    ((SELECT avg(CRIM) FROM boston where CHAS = 1) - (SELECT avg(CRIM) FROM boston where CHAS = 0)) as diff_mean
    union
    select 'ZN', 
    ((SELECT avg(ZN) FROM boston where CHAS = 1) - (SELECT avg(ZN) FROM boston where CHAS = 0)) as diff_mean
    union
    select 'INDUS', 
    ((SELECT avg(INDUS) FROM boston where CHAS = 1) - (SELECT avg(INDUS) FROM boston where CHAS = 0)) as diff_mean
    union
    select 'NOX', 
    ((SELECT avg(NOX) FROM boston where CHAS = 1) - (SELECT avg(NOX) FROM boston where CHAS = 0)) as diff_mean
    ) where diff_mean > 0
    ''',
    con,
)

  Column  diff_mean
0  INDUS   1.699950
1    NOX   0.041609

–í—ã–≤–æ–¥: –¥–æ–ª—è –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏ –≤—ã—à–µ –≤ —Ç–µ—Ö —Ä–∞–π–æ–Ω–∞—Ö, –≥–¥–µ –¥–æ–º–∞ –≥—Ä–∞–Ω–∏—á–∞—Ç —Å —Ä–µ–∫–æ–π, —Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å–Ω–æ, –ø–æ–≤—ã—à–∞–µ—Ç—Å—è –∏ —É—Ä–æ–≤–µ–Ω—å –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞

8. –í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX). –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [16]:
tasks+=1
pd.read_sql(
    '''
    select PCT, AVG(INDUS) as mean_INDUS, AVG(NOX) as mean_NOX from
    (
    select INDUS, NOX, (ntile(10) over(order by INDUS))*10 as PCT from boston
    ) group by PCT
    ''',
    con,
)

   PCT  mean_INDUS  mean_NOX
0   10    2.016078  0.438378
1   20    3.645294  0.494129
2   30    5.246275  0.448235
3   40    6.471765  0.470839
4   50    8.256078  0.531510
5   60   10.749216  0.515176
6   70   17.245800  0.649660
7   80   18.100000  0.675520
8   90   18.307200  0.676480
9  100   21.938800  0.655620

–í—ã–≤–æ–¥: –æ—á–µ–≤–∏–¥–Ω–∞ –∫–æ—Ä—Ä–µ–ª—è—Ü–∏—è —É—Ä–æ–≤–Ω—è –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–∞ –∞–∑–æ—Ç–∞ —Å –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏ –≤ —ç—Ç–∏—Ö —Ä–∞–π–æ–Ω–∞—Ö.

In [17]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ

P.S. –¥–æ—Å—Ç–∞—Ç–æ—á–Ω–æ —Ä–µ–¥–∫–æ –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–ª –æ–∫–æ–Ω–Ω—ã–µ —Ñ—É–Ω–∫—Ü–∏–∏, –Ω–µ —É–≤–µ—Ä–µ–Ω, —á—Ç–æ –º–æ–∏ —Å–ø–æ—Å–æ–±—ã —Ä–µ—à–µ–Ω–∏—è –æ–ø—Ç–∏–º–∞–ª—å–Ω—ã–µ. –ï—Å–ª–∏ –≤ –∫–∞–∫–æ–π-—Ç–æ –∑–∞–¥–∞—á–µ –Ω—É–∂–Ω–æ –∏—Å–ø–æ–ª—å–∑–æ–≤–∞—Ç—å –∏–º–µ–Ω–Ω–æ –æ–∫–æ–Ω–Ω—ã–µ —Ñ—É–Ω–∫—Ü–∏–∏, —Ç–æ –º–æ–≥—É –ø–æ–ø—Ä–æ–±–æ–≤–∞—Ç—å –ø–µ—Ä–µ–ø–∏—Å–∞—Ç—å –∫–æ–¥